some-repository/STM32F401CC_USB/main.c
        USB_OTG_DEV->DAINTMSK |= 0x10001U;              // EP0 OUT, EP0 IN Interupt
        USB_OTG_DEV->DOEPMSK |= USB_OTG_DOEPMSK_STUPM | // Enable setup-done interrupt
                                USB_OTG_DOEPMSK_XFRCM;  // Enable tx-done interrupt                                   
        USB_OTG_DEV->DIEPMSK |= USB_OTG_DIEPMSK_TOM   | // Timeout irq
                                USB_OTG_DIEPMSK_XFRCM;
        // buffers
        USB_OTG_FS->GRXFSIZ = RX_FIFO_SIZE; // size is in 32-bit words
        USB_OTG_FS->DIEPTXF0_HNPTXFSIZ = (TX_FIFO_EP0_SIZE << 16) | RX_FIFO_SIZE; // Set the position and size of the EP0 transmit buffer
        USB_OUTEP(0)->DOEPTSIZ = (1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |
                             USB_OTG_DOEPTSIZ_STUPCNT | (3 * 8); // Allow 3 setup packets of 8 bytes                                  
        USB_OTG_DEV->DCFG &= ~USB_OTG_DCFG_DAD;         // Clear address    
        USB_OTG_FS->GINTSTS = USB_OTG_GINTSTS_USBRST;   // Clear the flag by writing 1
        USB_OUTEP(0)->DOEPCTL = USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK; // Enable endpoint, Clear NAK bit
    }

    if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_ENUMDNE)
    { 
        print ("ENUMDNE\n", 8);
        USB_INEP(0)->DIEPCTL &= 0xFFFFFFFC; // reset bits 0 and 1 to set maximum packet size of MAX_PACKET_SIZE_EP0 = 64 bytes for EP0 TX&RX  
        USB_OTG_FS->GINTSTS |= USB_OTG_GINTSTS_ENUMDNE; // Clear the flag by writing 1
    }

    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_RXFLVL) // there is at least one packet pending to be read from the RxFIFO
    {
        USB_OTG_FS->GINTMSK &= ~USB_OTG_GINTMSK_RXFLVLM; // Mask the RXFLVL interrupt until reading the packet from the receive FIFO is done
        print ("RXFLVL\n", 7);

        uint32_t grxstsp = USB_OTG_FS->GRXSTSP;                                              // Rx packet status register
        uint16_t bcnt = ((grxstsp & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos);      // BCNT (length)
        uint8_t pktsts = ((grxstsp & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos); // Packet status
        uint8_t dpid = ((grxstsp & USB_OTG_GRXSTSP_DPID) >> USB_OTG_GRXSTSP_DPID_Pos);       // Data PID
        uint8_t epnum = ((grxstsp & USB_OTG_GRXSTSP_EPNUM) >> USB_OTG_GRXSTSP_EPNUM_Pos);    // Indicates EP number to which the current received packet belongs
        if (bcnt != 0) // Reading an empty receive FIFO can result in undefined core behavior
        {
            switch (epnum) 
            {
                case 0:
                {
                    if ((pktsts == SETUP) && (bcnt == 0x8) && (dpid == 0)) // setup packet received
                    {
                        read_ep (epnum, bufRX, bcnt); // Read setup packet
                        print ("SETUP packet received\n", 22);
                    }
                    else if (pktsts == SETUP_Done)
                    {
                        print ("SETUP done packet received\n", 27);
                    }
                    break;
                }
                default: // wrong EP number
                    break;
            } 
        }

        USB_OTG_FS->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM; // Unmask the RXFLVL interrupt after reading the packet from the receive FIFO  
    }

    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_OEPINT) // OUT -> RX endpoint interrupt
    {         
        print ("OEPINT\n", 7);
        
        uint32_t epNum; 
        uint32_t epInt;

        epNum = USB_OTG_DEV->DAINT;
        epNum &= USB_OTG_DEV->DAINTMSK;

        if (epNum & EP0_OUT_INT) // EP0 OUT RX Interrupt
        {      
            epInt = USB_OUTEP(0)->DOEPINT;
            epInt &= USB_OTG_DEV->DOEPMSK;

            if (epInt & USB_OTG_DOEPINT_STUP) // On this interrupt, the application can decode the received SETUP data packet.
            {
                USB_device_setup (bufRX); // Decode setup packet
            }

            USB_OUTEP(0)->DOEPINT = epInt; // Clear interrupt flags in DOEPINT register
            USB_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA; // Enable endpoint, Clear NAK bit
        }
    }   

    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_IEPINT) // OUT -> TX endpoint interrupt
    {
        print ("IEPINT\n", 7);
            
        uint32_t epNum; 
        uint32_t epInt;

        epNum = USB_OTG_DEV->DAINT;
        epNum &= USB_OTG_DEV->DAINTMSK;

        if (epNum & EP0_OUT_INT) // EP0 OUT RX Interrupt
        {      
            epInt = USB_INEP(0)->DIEPINT;
            epInt &= USB_OTG_DEV->DIEPMSK;

            USB_INEP(0)->DIEPINT = epInt; // Clear interrupt flags in DIEPINT register
        }   
    }
    

    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_MMIS)
    {
        print ("MMIS\n", 5);
        
        USB_OTG_FS->GINTSTS |= USB_OTG_GINTSTS_MMIS; // Clear the flag (rc_w1)
    }  

    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_SOF) 
    {   
        print ("SOF\n", 4);  
        
        USB_OTG_FS->GINTSTS |= USB_OTG_GINTSTS_SOF; // Clear the flag (rc_w1)
    }    
    
    print ("interrupt exit\n", 15);
}

void read_ep (const uint8_t ep, uint8_t *buf, const uint8_t len)
{
    int16_t i; 
    uint32_t word;
    for(i = pos; i < ((len + 3) / 4); i++)
        {
            word = USB_FIFO(ep); //read 32 bit word from RX FIFO
            buf [4 * i] = (uint8_t) (word & 0xFF);
            buf [(4 * i) + 1] = (uint8_t) ((word & 0xFF00) >> 8);
            buf [(4 * i) + 2] = (uint8_t) ((word & 0xFF0000) >> 16);
            buf [(4 * i) + 3] = (uint8_t) ((word & 0xFF000000) >> 24);
        }
    pos = i;
}*/

/*void send_ep (const uint8_t ep, const uint8_t *buf, const uint8_t len)
{
    if ((len != 0) && (buf == NULL))
    {
        return;
    }
    if (len > MAX_PACKET_SIZE_EP0) // check if len <= MAX_PACKET_SIZE_EP0
    {
        return;
    }

    while ((((USB_INEP(ep)->DTXFSTS) & 0xFFFF) * 4) < (uint32_t) len); // wait until there is enough space in TX FIFO

    uint8_t i, j;
    uint32_t tmp = 0;
    USB_INEP(ep)->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | len;       // one packet of len bytes
    USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;   // Enable endpoint, clear NAK bit     
    for (i = 0; i < ((len + 3) / 4); i++) 
    {
        tmp = 0;
        for (j = 0; j < 4; j++)
        {
            if (((i * 4) + j) < len)
            {
                tmp |= (((uint32_t) *(buf + (4 * i) + j)) << (8 * j));
            }
        }
        USB_FIFO(ep) = tmp; // Copy data 
    } 
}*/

/*void stall_TX_ep (uint8_t ep)
{
    USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
}*/

