some-repository/STM32F401CC_USB/main.c
/*void USB_device_setup (uint8_t *buf)
{
    const uint8_t bmRequestType = buf [0];
    const uint8_t bRequest = buf [1];
    const uint16_t wValue = buf [2] | ((uint16_t) buf [3] << 8);
    const uint16_t wIndex = buf [4] | ((uint16_t) buf [5] << 8);  
    const uint16_t wLength = buf [6] | ((uint16_t) buf [7] << 8);

    switch (bmRequestType & REQUEST_RECIPIENT_MASK)
    {
        case RECIPIENT_DEVICE: // Recipient is device
        {
            switch (bmRequestType & REQUEST_TYPE_MASK)
            {
                case REQUEST_CLASS:
                case REQUEST_VENDOR:
                    break;
                case REQUEST_STANDARD:
                switch (bRequest)
                {
                    case GET_DESCRIPTOR:
                    {
                        print ("GET DESCRIPTOR\n", 15);

                        get_descriptor (wValue, wLength);
                        break;
                    }                               
                    case SET_ADDRESS:
                    {
                        print ("SET ADDRESS\n", 12);
                        
                        set_address (buf [2]);                                                     
                        break;
                    }
                    case SET_CONFIGURATION:
                    {
                        //setConfig ();
                        break;
                    }
                    case GET_CONFIGURATION:
                        break;
                    case GET_STATUS:
                        break;
                    case SET_FEATURE:
                        break;
                    case CLEAR_FEATURE:
                        break;
                    default:
                        break;
                }
            }
        }
        case RECIPIENT_ENDPOINT:
            break;
        case RECIPIENT_INTERFACE:
            break;
        default:
            break;
    }
}*/

/*void set_address (uint8_t address)
{
    print ("address = ", 10);
    print (&address, 1);
    print ("\n", 1);
    
    USB_OTG_DEV->DCFG |= (((uint32_t) address) << 4); // SEE ERRATA 2.8.4
    send_ep (0, 0, 0); 
}*/

/*void get_descriptor (uint16_t wValue, uint16_t wLength)
{
    uint8_t *ptr;
    uint8_t len = 0;
    switch (wValue >> 8)    
    {
        case DESC_DEVICE: // Request device descriptor
        {
            ptr = (uint8_t*) desc_device; 
            len = 18;             
            break;  
        }
                         
        case DESC_CONFIG: // Request configuration descriptor
        {
            ptr = (uint8_t*) desc_config;
            len = sizeof (desc_config);
            break;  
        }
                          
        case DESC_STRING: // Request string descriptor
        {
            switch (wValue & 0xFF) // Request string descriptor
            {
                case DESC_STR_LANGID:  // Lang
                {
                    ptr = (uint8_t*) desc_lang;
                    len = sizeof (desc_lang);   
                    break;
                }
                                                                  
                case DESC_STR_MFC:     // Manufacturer
                {
                    //pbuf = (uint8_t*) desc_vendor; 
                    //len = sizeof (desc_vendor);
                    break;
                }
                    
                case DESC_STR_PRODUCT: // Product
                {
                    //ptr = (uint8_t*) desc_product; 
                    //len = sizeof (desc_product);
                    break;
                }
                    
                case DESC_STR_SERIAL:  // SerialNumber
                {
                    //ptr = (uint8_t*) desc_serial;
                    //len = sizeof (desc_serial); 
                    break;
                }
                    
                case DESC_STR_CONFIG:  // Config
                {
                    ptr = (uint8_t*) desc_config;
                    len = sizeof (desc_config);
                    break;
                }
                    
                case DESC_STR_INTERFACE:// Interface
                    break;
                default:
                    break;
            }
            break;   
        }

        default:
        {
            stall_TX_ep (0); // we don't know how to handle this request                      
            break;  
        }    
    }
    if (len)
    {    
        send_ep (0, ptr, MIN(len, wLength));   
    }  
}*/

int main (void)
{
    RCC_config ();
    //GPIO_config ();
    UART_config ();
    //USB_config ();
    init ();

    print ("print test\n");

    while (1) 
    {

    }
}
//-------------------------------------------------------------------
void OTG_FS_IRQHandler(void)
{   
    print ("Interrupt entry\n");
    intr();
    print ("Interrupt exit\n");
}
 
void intr(void)
{
    if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_RXFLVL)                      // RX level interrupt
    {
        print ("RXFLVL\n");
        uint32_t status = USB_OTG_FS->GRXSTSP;
        uint16_t len = (status & USB_OTG_GRXSTSP_BCNT) >> 4;                 // Read len
        if(((status & USB_OTG_GRXSTSP_PKTSTS) >> 17) == 0x02)              // Data
        {
            if(len)
            {                         
                read(status & USB_OTG_GRXSTSP_EPNUM, &bufRx[countRx] , len); // Read data
                epNumLastRx = status & USB_OTG_GRXSTSP_EPNUM;                // Save last endpoint num
                countRx += len;                                              // Save all len
            }
        }
        if(((status & USB_OTG_GRXSTSP_PKTSTS) >> 17) == 0x06)              // Setup data packet received
        {    
            read(status & USB_OTG_GRXSTSP_EPNUM, bufRx, 0x08);                    // Read setup packet
        }   
    }
    if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_OEPINT) // OUT -> RX endpoint interrupt
    {         
        print ("OEPINT\n");
        uint32_t epNum; 
        uint32_t epInt;
        epNum = USB_OTG_DEV->DAINT;
        epNum &= USB_OTG_DEV->DAINTMSK;
        if(epNum & EP0_OUT_INT)                       // EP0 OUT RX Interrupt
        {      
            epInt = USB_OUTEP(0)->DOEPINT;
            epInt &= USB_OTG_DEV->DOEPMSK;
            if(epInt & USB_OTG_DOEPINT_STUP)
            {
                print ("STUP\n");
                setup(bufRx);                            // Parse setup packet
            }
            USB_OUTEP(0)->DOEPINT = epInt;              // Clear flag
            USB_OUTEP(0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | 
                                        USB_OTG_DOEPCTL_EPENA; // Enable endpoint, Clear NAK bit
        }   
        if(epNum & EP1_OUT_INT)                        // EP1 OUT RX Interrupt
        {
            epInt = USB_OUTEP(1)->DOEPINT;
            epInt &= USB_OTG_DEV->DOEPMSK;
            USB_OUTEP(1)->DOEPINT = epInt;               // Clear flag
            USB_OUTEP(1)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | 
                                        USB_OTG_DOEPCTL_EPENA; // Enable endpoint, Clear NAK bit
        }               
    }
    if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_IEPINT)   // IN -> TX endpoint interrupt
    {     
        print ("IEPINT\n");
        uint32_t epNum;
        uint32_t epInt;      
        epNum = USB_OTG_DEV->DAINT;
        epNum &= USB_OTG_DEV->DAINTMSK;
        if(epNum & EP0_IN_INT)                          // EP0 IN TX Interrupt
        {
            epInt = USB_INEP(0)->DIEPINT;
            epInt &= USB_OTG_DEV->DIEPMSK;
            if(epInt & USB_OTG_DIEPINT_XFRC)
            {
                sendEnd(0);                               // If data left to send
            }
            USB_INEP(0)->DIEPINT = epInt;                // Clear flag              
        }
        if(epNum & EP1_IN_INT)                          // EP1 IN TX Interrupt
        {
            epInt = USB_INEP(1)->DIEPINT;
            epInt &= USB_OTG_DEV->DIEPMSK;
            if(epInt & USB_OTG_DIEPINT_XFRC)
            {
                sendEnd(1);                               // If data left to send
            }
            USB_INEP(1)->DIEPINT = epInt;                // Clear flag             
        }                 
    }
    if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_USBRST)   // Reset Int
    {
        print ("USBRST\n");
        USB_OTG_DEV->DCTL &= ~USB_OTG_DCTL_RWUSIG;      // Wakeup signal disable    
        flushTx();                                      // Clear tx buffer
        for(uint8_t i = 0U; i < 4; i++)                 // Clear any pending EP flags
        {
            USB_INEP(i)->DIEPINT = 0xFB7FU;
            USB_INEP(i)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
            USB_INEP(i)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
            USB_OUTEP(i)->DOEPINT = 0xFB7FU;
            USB_OUTEP(i)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
            USB_OUTEP(i)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;               
        }
        USB_OTG_DEV->DAINTMSK |= 0x10001U;              // EP0 OUT, EP0 IN Interupt              
        USB_OTG_DEV->DOEPMSK |= USB_OTG_DOEPMSK_STUPM | // Enable setup-done irq
                            USB_OTG_DOEPMSK_EPDM  | // Enable EP-disabled irq
                            USB_OTG_DOEPMSK_XFRCM;  // Enable tx-done irq                                    
        USB_OTG_DEV->DIEPMSK |= USB_OTG_DIEPMSK_TOM   | // Timeout irq
                            USB_OTG_DIEPMSK_XFRCM |
                            USB_OTG_DIEPMSK_EPDM; 
        /* Setup EP0 to receive SETUP packets */
        USB_OUTEP(0)->DOEPTSIZ = (1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |
                             USB_OTG_DOEPTSIZ_STUPCNT | // Allow 3 setup pkt
                             (3 * 8);    
        USB_OUTEP(0)->DOEPCTL = USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;   // Enable endpoint, Clear NAK bit                                  
        USB_OTG_DEV->DCFG &= ~USB_OTG_DCFG_DAD;         // Clear address    
        USB_OTG_FS->GINTSTS = USB_OTG_GINTSTS_USBRST;   // Clear flag    
    }
 if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_ENUMDNE)
   { 
       print ("ENUMDNE\n");
    USB_OTG_FS->GINTSTS |= USB_OTG_GINTSTS_ENUMDNE; // Clear the flag  
   } 
 if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_MMIS)
   {
       print ("MMIS\n");
    USB_OTG_FS->GINTSTS |= USB_OTG_GINTSTS_MMIS;
   }  
 if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_SOF)
   {     
       print ("SOF\n");
    USB_OTG_FS->GINTSTS |= USB_OTG_GINTSTS_SOF;     // Clear the flag (rc_w1)
   }    
}
 
/* This function is sending data */
void sendData(const uint8_t ep, const uint8_t *buf, uint8_t len)
{
 while(countTx);
 countTx = len;                                  // Save all len
 if(len > MAX_SIZE)                              // Larger maximum size?
          {                                          // Create queue for send
             len = MAX_SIZE;                           // Set maximum size
             bufTx =(uint8_t*) buf;                    //   Save ptr for new send
            }       
 send(ep, buf, len);                             // Send data           
}
 
 
void sendEnd(const uint8_t ep) 
{
 if(countTx > MAX_SIZE)                          // If queue for send?
   {
      bufTx = (uint8_t*) (bufTx + MAX_SIZE);       // Calculating ptr for send
    countTx -= MAX_SIZE;                           // Calculating length
    send(ep, bufTx, countTx);                    // Send data        
     }
 else countTx = 0;                               // No queue for send
}   
 
/* This function reads received data from the buffer */
uint16_t readData(const uint8_t ep, uint8_t *buf)
{
 uint16_t i, len = 0;
 if(ep == epNumLastRx)                                                           
   {
    if(countRx)                                      // If read data
          {
             for(i = 0; i < countRx; i++)
                  {
                     *buf++ = bufRx[i];                        // Copy data
                    }
             len = countRx;
       countRx = 0; 
       epNumLastRx = 0;                 
            }
   }         
 return len;
}
 
 
void send(const uint8_t ep, const uint8_t *buf, const uint8_t len)
{
 uint16_t i;
 uint32_t *ptr = (uint32_t *)buf;
 USB_INEP(ep)->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | len;       // Set outbound txlen
 USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;   // Enable endpoint, clear NAK bit     
 for(i = 0; i < ((len + 3) / 4); i++) 
      {
     USB_FIFO(ep) = __UNALIGNED_UINT32_READ(ptr);                         // Copy data 
         ptr++;
        } 
}
 
 
void read(const uint8_t ep, const uint8_t *buf, const uint8_t len)
{
 int16_t i; 
 uint32_t   *ptr = (uint32_t *)buf;
 for(i = 0; i < ((len + 3) / 4); i++)
      {
         __UNALIGNED_UINT32_WRITE(ptr, USB_FIFO(ep));         // Read data
         ptr++; 
        }
}
 
 
void init(void)
{
 /* Enable clock */
 RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
 RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
 /* Port config */ 
 GPIOA->AFR[1] |= (10 << GPIO_AFRH_AFSEL12_Pos) | (10 << GPIO_AFRH_AFSEL11_Pos); // PA12 -> OTG_FS_DP, PA11 -> OTG_FS_DM
 GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR12 | GPIO_OSPEEDER_OSPEEDR11;            // PA12 PA11 Very high speed
 GPIOA->MODER |= GPIO_MODER_MODE12_1 | GPIO_MODER_MODE11_1;                      // Alternate function
 /* Core */
 while (!(USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL));
 USB_OTG_FS->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
 while (USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_CSRST); 
 USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_PWRDWN | USB_OTG_GCCFG_NOVBUSSENS; // Exit Power Down mode
 USB_OTG_FS->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD | (0x06 << USB_OTG_GUSBCFG_TRDT_Pos) | USB_OTG_GUSBCFG_PHYSEL | (17 << USB_OTG_GUSBCFG_TOCAL_Pos); // Set to Device mode
 USB_OTG_FS->GINTMSK |= USB_OTG_GINTMSK_IEPINT |   // Enable USB IN TX endpoint interrupt
                          USB_OTG_GINTMSK_OEPINT |   // Enable USB OUT RX endpoint interrupt
                        USB_OTG_GINTMSK_RXFLVLM |  // USB reciving
                        USB_OTG_GINTMSK_USBRST;    // Reset interrupt
 USB_OTG_FS->GAHBCFG = USB_OTG_GAHBCFG_GINT;       // On USB general interrupt
 /* Device */
 USB_OTG_DEV->DCFG |= USB_OTG_DCFG_NZLSOHSK | USB_OTG_DCFG_DSPD_1 | USB_OTG_DCFG_DSPD_0; //Full speed, STALL for all OUT requests
 /* Buffers */
 USB_OTG_FS->GRXFSIZ = RX_FIFO_SIZE; // size is in 32-bit words !
 USB_OTG_FS->DIEPTXF0_HNPTXFSIZ = (TX_FIFO_EP0_SIZE << 16) | RX_FIFO_SIZE;              // Set the position and size of the transmit buffer
 USB_OTG_FS->DIEPTXF[1] = (TX_FIFO_EP1_SIZE << 16) | (RX_FIFO_SIZE + TX_FIFO_EP0_SIZE); // Set the position and size of the transmit buffer     
 USB_OTG_FS->DIEPTXF[2] = (TX_FIFO_EP2_SIZE << 16) | (RX_FIFO_SIZE + TX_FIFO_EP0_SIZE + TX_FIFO_EP1_SIZE);
 /* Interrupt */
 NVIC_SetPriority(OTG_FS_IRQn, 1);
 NVIC_EnableIRQ(OTG_FS_IRQn);   
}
 
 
void setup(uint8_t *buf)
{
 const uint8_t bmRequestType = buf[0];
 const uint8_t bRequest = buf[1];
 const uint16_t wValue = buf[2] | ((uint16_t)buf[3] << 8);
 const uint16_t wIndex = buf[4] | ((uint16_t)buf[5] << 8);  
 const uint16_t wLength = buf[6] | ((uint16_t)buf[7] << 8); 
 uint8_t data[8];
 switch(bmRequestType & 0x1FU)
       {
          case REQ_DEVICE: 
                     switch(bmRequestType & REQ_MASK)
                               {
                                  case REQ_CLASS:
                                      case REQ_VENDOR:
                                        break;
                                        case REQ_STANDARD:
                                        switch(bRequest)
                                              {
                                                 case GET_DESCRIPTOR:
                                                        print ("GET_DESCRIPTOR\n");
                                                        getDesc(wValue, wLength);
                                                 break; 
                                                     case SET_ADDRESS:
                                                     print ("SET_ADDRESS\n");
                                                          setAddr(buf[2]);                                                     
                                                     break;
                                                     case SET_CONFIGURATION:
                                                            print ("SET_CONFIGURATION\n");
                                                            setConfig();
                           break;
                           case GET_CONFIGURATION:
                           break;
                           case GET_STATUS:
                           break;
                           case SET_FEATURE:
                           break;
                           case CLEAR_FEATURE:
                           break;
                           default:
                           break;
                                                    }                                       
                                        break;
                                     }
                break;
            case REQ_INTERFACE:
             
             sendData(0, data, wLength);
             if(bRequest == 34) countRx = 0;                
        break;              
            case REQ_ENDPOINT:  
                break;
             }
} 
 
 
void getDesc(uint16_t wValue, uint16_t wLength)
{
 uint8_t *pbuf;
 uint8_t len = 0;
 switch(wValue >> 8)    
       {
          case DESC_DEVICE:                  // Request device descriptor
                       pbuf = (uint8_t*)desc_device; 
             len = sizeof(desc_device);             
        break;  
        case DESC_CONFIG:                  // Request configuration descriptor
                       pbuf = (uint8_t*) desc_config;
                     len = sizeof(desc_config);
        break;   
        case DESC_STRING:                  // Request string descriptor
                     switch(wValue & 0xFF)         // Request string descriptor
                                   {
                                      case DESC_STR_LANGID:  // Lang
                                               pbuf = (uint8_t*) desc_lang;
                                                 len = sizeof(desc_lang);   
                    break;                                              
                                        /*case DESC_STR_MFC:     // Manufacturer
                         pbuf = (uint8_t*) desc_vendor, 
                                             len = sizeof(desc_vendor); 
                    break;
                    case DESC_STR_PRODUCT: // Product
                         pbuf = (uint8_t*) desc_product; 
                                             len = sizeof(desc_product);
                    break;
                    case DESC_STR_SERIAL:  // SerialNumber
                         pbuf = (uint8_t*) desc_serial;
                                     len = sizeof(desc_serial); 
                    break;*/
                                      case DESC_STR_CONFIG:  // Config
                                                 pbuf = (uint8_t*) desc_config;
                                         len = sizeof(desc_config);
                                      break;
                    case DESC_STR_INTERFACE:// Interface
                    break;
                    default:
                                        break;
                                     }                          
                break;                                      
                case DESC_OTHER_CONFIG:
                       stallTx(0); // we don't know how to handle this request                      
          break;
             }
 if(len)
   {    
      sendData(0, pbuf, MIN(len,wLength));   
     }  
}
 
 
void setAddr(uint8_t addr)
{
 USB_OTG_DEV->DCFG |= ((uint32_t)addr << 4);
 send(0, 0, 0); 
}
 
 
void setConfig(void)
{               
 /* Open EP1 IN */
 USB_OTG_DEV->DAINTMSK |=   (1 << 1);                           // Enable Interupt
 USB_INEP(1)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM |     // Set DATA0
                           (1 << USB_OTG_DIEPCTL_TXFNUM_Pos)|   // TxFIFO number
                           USB_OTG_DIEPCTL_EPTYP_1 |            // Endpoint type bulk
                           USB_OTG_DIEPCTL_USBAEP |             // Active endpoint
                           MAX_SIZE;                            // Max packet size
 /* Open EP1 OUT */
 USB_OTG_DEV->DAINTMSK |= (1 << 17);                          // Enable Interupt
 USB_OUTEP(1)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA |             // Endpoint enable
                            USB_OTG_DOEPCTL_SD0PID_SEVNFRM |    // Set DATA0
                            USB_OTG_DOEPCTL_CNAK |              // Clear NAK
                            USB_OTG_DOEPCTL_EPTYP_1 |           // Endpoint type bulk
                            USB_OTG_DOEPCTL_USBAEP |            // Active endpoint 
                            MAX_SIZE;                           // Max packet size
 /* Open Command EP2 IN  */
 USB_OTG_DEV->DAINTMSK |= (1 << 2);                           // Enable Interupt
 USB_INEP(2)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM |     // Set DATA0
                           (1 << USB_OTG_DIEPCTL_TXFNUM_Pos)|   // TxFIFO number
                           USB_OTG_DIEPCTL_EPTYP |              // Endpoint type Interrupt
                           USB_OTG_DIEPCTL_USBAEP |             // Active endpoint
                           MAX_SIZE;                            // Max packet size
 send(0, 0, 0);
}
 
 
void flushTx(void)
{
 print ("flushTx\n");
 USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (1 << 10);
 while(USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
}
 
 
void flushRx(void)
{
 print ("flushRx\n");
 USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
 while (USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH);
}
 
 
void stallTx(uint8_t ep)
{
 print ("stallTx\n");
 USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
}
